# Конспект: Арифметика и алгоритмы

## 1. Базовая теория чисел

### 1.1. Операции деления
*   `/` — обычное деление (возвращает `float`).
*   `//` — целочисленное деление (деление нацело, возвращает целую часть).
*   `%` — остаток от деления (модуль).
    *   Если `a % b == 0`, значит **`a` делится на `b` нацело**.

### 1.2. Диапазоны в Python
*   `range(n)` — числа от 0 до n-1.
*   `range(1, n)` — числа от 1 до n-1.
*   `range(2, int(n**0.5) + 1)` — числа от 2 до корня из n (оптимизация для проверки делителей).

---

## 2. Поиск всех делителей числа

**Задача:** Найти все числа, на которые `N` делится без остатка.

**Оптимизация:** Делители всегда ходят парами (`d` и `N/d`). Поэтому достаточно проверить числа до `√N`.

Пример реализации:
```python
def find_divisors(n):
    divisors = []
    for i in range(1, int(n**0.5) + 1):
        if n % i == 0:
            divisors.append(i)
            if i != n // i:              
                divisors.append(n // i)  
    return sorted(divisors)

print(find_divisors(28))  # Вывод: [1, 2, 4, 7, 14, 28]
```


## 3. Проверка числа на простоту (Тест на простоту)

**Простое число** — число, которое имеет ровно два различных делителя: 1 и само себя.

Пример реализации:
```python
def is_prime(n):
    """
    Проверяет, является ли число n простым.
    """
    if n <= 1:
        return False
    if n == 2:
        return True
    if n % 2 == 0:
        return False 

    for i in range(3, int(n**0.5) + 1, 2):
        if n % i == 0:
            return False
    return True

print(is_prime(17))  # True
print(is_prime(25))  # False
```

## 4. Факториал числа

**Факториал:** `n! = 1 * 2 * 3 * ... * n`.  
Особенность: Очень быстро растет. Для больших чисел в Python встроена поддержка длинной арифметики, но вычисления могут быть долгими.

### 4.1. Итеративный способ
Пример реализации:
```python
def factorial_iter(n):
    result = 1
    for i in range(2, n + 1):
        result *= i
    return result

print(factorial_iter(5))  # 120
```

### 4.2. Рекурсивный способ
Пример реализации:
```python
def factorial_rec(n):
    if n == 0:
        return 1
    return n * factorial_rec(n - 1)

print(factorial_rec(5))  # 120
```

### 4.3. Встроенная функция (для справки)
```python
import math
print(math.factorial(5))  # 120
```

## 5. Поиск количества нулей в конце факториала

**Задача:** Сколько нулей в конце числа `n!`?  
**Логика:** Ноль в конце дает произведение 2 и 5. Двоек всегда больше, чем пятерок. Значит, количество нулей равно количеству пятерок в разложении на множители.

**Формула Лежандра:**  
Количество нулей = `n//5 + n//25 + n//125 + ...` (пока делитель меньше n).

Пример реализации:
```python
def count_trailing_zeros(n):
    """
    Считает количество нулей в конце факториала n!
    """
    count = 0
    divisor = 5
    while n // divisor > 0:
        count += n // divisor
        divisor *= 5
    return count

print(count_trailing_zeros(25))  # 6 (25! заканчивается на 6 нулей)
```

## 6. Максимальная степень, на которую делится число

**Задача:** Найти максимальную степень `k` числа `x`, такую что `n!` делится на `x^k`.  
**Частный случай:** Найти, в какой максимальной степени простое число `p` входит в факториал `n!` (та же формула Лежандра, что и выше).

**Общий случай (для составного x):** Сложнее, но для простого делителя используем функцию выше.

*Пример:* В какой максимальной степени 2 делит 10! ?  
Это будет `10//2 + 10//4 + 10//8 = 5 + 2 + 1 = 8`. То есть `2^8` делит 10!.

## 7. Решето Эратосфена

**Задача:** Найти все простые числа от 2 до `n` максимально быстро.  
**Суть:** Создаем список "кандидатов". Начинаем с 2. Если число простое, вычеркиваем все его кратные.

Пример реализации:
```python
def sieve_of_eratosthenes(n):
    if n < 2:
        return []

    is_prime = [True] * (n + 1)
    is_prime[0] = is_prime[1] = False

    for i in range(2, int(n**0.5) + 1):
        if is_prime[i]:
            for j in range(i * i, n + 1, i):
                is_prime[j] = False

    primes = [i for i in range(2, n + 1) if is_prime[i]]
    return primes

print(sieve_of_eratosthenes(30))  # [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
```

### Визуализация алгоритма:
1.  Список: `[True, True, True, ...]`
2.  Берем 2 — простое, вычеркиваем 4, 6, 8...
3.  Берем 3 — простое, вычеркиваем 9, 12, 15...
4.  Берем 4 — уже вычеркнуто (пропускаем).
5.  И так далее...

## Полезные формулы и советы для Junior Developer

1.  **Проверка на четность:** `if n % 2 == 0`
2.  **Корень числа:** `int(n**0.5)` — для ограничения перебора.
3.  **Сумма цифр числа:**
    ```python
    sum_digits = sum(int(digit) for digit in str(n))
    ```
4.  **Разложение на простые множители:**
    Пример реализации:
    ```python
    def prime_factors(n):
        factors = []
        d = 2
        while d * d <= n:
            while n % d == 0:
                factors.append(d)
                n //= d
            d += 1
        if n > 1:
            factors.append(n)
        return factors
    ```

### Рекомендации
*   Всегда проверять граничные случаи: `n = 0`, `n = 1`, `n = 2`.
*   Помнить про оптимизацию `int(n**0.5)`, чтобы не проверять лишние делители — это спасет от таймаутов.
*   Для факториалов больших чисел (более 1000) использовать итеративный метод, чтобы избежать переполнения стека.